[
    {
        "id": 1,
        "courseName": "Introduction to OOP Python",
        "image": "https://i.ibb.co/svzwNgP/Rectangle-2.png",
        "credit": 3,
        "price": 4900,
        "courseDetails": "Learn Python's Object-Oriented Programming (OOP) principles and practices in this comprehensive course. Python's versatility and strong OOP support make it an ideal choice for software development."
    },
    {
        "id": 2,
        "courseName": "Database (MySQL)",
        "image": "https://i.ibb.co/ss05Ywd/Rectangle-2-1.png",
        "credit": 4,
        "price": 6900,
        "courseDetails": "Master MySQL for database creation, management, and optimization in this comprehensive course. Gain the knowledge and skills needed for effective database management."
    },
    {
        "id": 3,
        "courseName": "Introduction to C Programming",
        "image": "https://i.ibb.co/YRtYWLY/Rectangle-2-2.png",
        "credit": 3,
        "price": 5900,
        "courseDetails": "Build a strong foundation in the C programming language with this course. Explore C's simplicity, efficiency, and portability."
    },
    {
        "id": 4,
        "courseName": "Introduction to Algorithms",
        "image": "https://i.ibb.co/jDk85RV/Rectangle-2-3.png",
        "credit": 5,
        "price": 7999,
        "courseDetails": "Discover fundamental principles and techniques for designing and analyzing algorithms in this course. Algorithms are essential step-by-step problem-solving procedures widely used in computer science."
    }, {
        "id": 5,
        "courseName": "Introduction to C++ for DSA",
        "image": "https://i.ibb.co/vjBwptw/Rectangle-2-4.png",
        "credit": 4,
        "price": 6499,
        "courseDetails": "Explore C++ programming and its role in solving data structures and algorithmic problems in this course. Learn C++ syntax and its efficient use in designing common data structures and algorithms."
    }, {
        "id": 6,
        "courseName": "Software Engineering",
        "image": "https://i.ibb.co/Y3zkRCs/Rectangle-2-5.png",
        "credit": 3,
        "price": 5499,
        "courseDetails": "Comprehensive software engineering course covering design, development, testing, and maintenance with industry best practices."
    }, {
        "id": 7,
        "courseName": "Problem-Solving Part",
        "image": "https://i.ibb.co/PCxkQzC/Rectangle-2-6.png",
        "credit": 4,
        "price": 6999,
        "courseDetails": "Enhance problem-solving skills in our Problem-Solving for Software Engineers course. Tackle real-world coding challenges, algorithmic puzzles, and software design problems."
    }, {
        "id": 8,
        "courseName": "AWS, Cloud Computing",
        "image": "https://i.ibb.co/X46Yw2s/Rectangle-3-1.png",
        "credit": 6,
        "price": 9909,
        "courseDetails": "Start your cloud journey with our AWS & Cloud Computing course. Discover cloud capabilities, master AWS, and gain hands-on cloud resource expertise."
    }, {
        "id": 9,
        "courseName": "Basic Data Structures",
        "image": "https://i.ibb.co/3h16Y8P/Rectangle-3.png",
        "credit": 4,
        "price": 7409,
        "courseDetails": "Establish a strong data structures foundation in our Basic Data Structures for Software Engineers course. Delve into essential concepts including arrays, linked lists, stacks, and queues."
    }
]
